import asyncio
import dbopenapi
from common import *
from app_keys import appkey, appsecretkey, saved_access_token # app_keys.py 파일에 appkey, appsecretkey 변수를 정의하고 사용하세요

'''
일봉 거래량 필드 매뉴얼과 다름
'''
async def main():
    api=dbopenapi.OpenApi()
    # if not await api.login(appkey, appsecretkey): return print(f'연결실패: {api.last_message}')
    if not await api.login('', '', access_token=saved_access_token): return print(f'연결실패: {api.last_message}')

    while True:
        시장분류코드 = input('시장분류코드를 입력하세요 (FY:뉴욕, FN:나스닥, FA:아멕스): ')
        종목코드 = input('종목코드를 입력하세요 (ex.AAPL): ')
        차트종류 = input('차트종류를 입력하세요 (1:틱, 2:분, 3:일, 4:주, 5:월): ')
        N봉 = input('N봉을 입력하세요: ') if 차트종류 == '1' or 차트종류 == '2' else ''
        
        response = None
        trcode = None
        if 차트종류 == '1': # 틱
            request = {
                'In': {
                    'InputCondMrktDivCode': 시장분류코드, # 입력조건시장분류코드
                    'InputIscd1': 종목코드, # 입력종목코드1
                    'InputDate1': '', # 입력날짜1
                    'InputDate2': '', # 입력날짜2
                    'InputDivXtick': N봉 # 입력X틱분틱일별구분코드
                }
            }
            trcode = 'FSTKCHARTTICK'
        elif 차트종류 == '2': # 분
            request = {
                'In': {
                    'InputCondMrktDivCode': 시장분류코드, # 입력조건시장분류코드
                    'InputIscd1': 종목코드, # 입력종목코드1
                    'InputDate1': '', # 입력날짜1
                    'InputDate2': '', # 입력날짜2
                    'InputDivXtick': str(60*int(N봉)) # 분일별구분코드
                }
            }
            trcode = 'FSTKCHARTMIN'
        elif 차트종류 == '3': # 일
            request = {
                'In': {
                    'InputCondMrktDivCode': 시장분류코드, # 입력조건시장분류코드
                    'InputIscd1': 종목코드, # 입력종목코드1
                    'InputDate1': '', # 입력날짜1
                    'InputDate2': '' # 입력날짜2
                }
            }
            trcode = 'FSTKCHARTDAY'
        elif 차트종류 == '4': # 주
            request = {
                'In': {
                    'InputCondMrktDivCode': 시장분류코드, # 입력조건시장분류코드
                    'InputIscd1': 종목코드, # 입력종목코드1
                    'InputDate1': '', # 입력날짜1
                    'InputDate2': '', # 입력날짜2
                    'InputPeriodDivCode': 'W' # 입력일/주/월/년
                }
            }
            trcode = 'FSTKCHARTWEEK'
        elif 차트종류 == '5': # 월
            request = {
                'In': {
                    'InputCondMrktDivCode': 시장분류코드, # 입력조건시장분류코드
                    'InputIscd1': 종목코드, # 입력종목코드1
                    'InputDate1': '', # 입력날짜1
                    'InputDate2': '' # 입력날짜2
                }
            }
            trcode = 'FSTKCHARTMONTH'
        if not trcode:
            print('잘못된 차트종류 입력')
            continue
        
        response = await api.request(trcode, request)
        if response is None:
            print(f'요청실패: {api.last_message}')
        else:
            print_table(response.body['Out'])
            
        pass # end while, 시장분류코드 입력받기 위한 무한루프
    
    ... # 다른 작업 수행
    await api.close()

asyncio.run(main())


# Output:
'''
시장분류코드를 입력하세요 (FY:뉴욕, FN:나스닥, FA:아멕스): FN
종목코드를 입력하세요 (ex.AAPL): AAPL
차트종류를 입력하세요 (1:틱, 2:분, 3:일, 4:주, 5:월): 3
Row Count = 400
+------+----------+----------+----------+----------+----------+-----------+
| Hour |   Date   |   Prpr   |   Oprc   |   Hprc   |   Lprc   |  AcmlVol  |
+------+----------+----------+----------+----------+----------+-----------+
|      | 20240517 | 189.7050 | 189.8400 | 190.8100 | 189.2200 |  11476481 |
|      | 20240516 | 189.8400 | 190.4700 | 191.0950 | 189.6601 |  52845230 |
|      | 20240515 | 189.7200 | 187.9100 | 190.6500 | 187.3700 |  70399988 |
|      | 20240514 | 187.4300 | 187.5100 | 188.3000 | 186.2900 |  52393619 |
|      | 20240513 | 186.2800 | 185.4350 | 187.1000 | 184.6200 |  72044809 |
|      | 20240510 | 183.0500 | 184.9000 | 185.0900 | 182.1300 |  50759496 |
|      | 20240509 | 184.5700 | 182.5600 | 184.6600 | 182.1100 |  48982972 |
|      | 20240508 | 182.7400 | 182.8500 | 183.0700 | 181.4500 |  45057087 |
|      | 20240507 | 182.4000 | 183.4500 | 184.9000 | 181.3200 |  77305771 |
|      | 20240506 | 181.7100 | 182.3540 | 184.2000 | 180.4200 |  78569667 |
|      | 20240503 | 183.3800 | 186.6450 | 187.0000 | 182.6600 | 163224109 |
|      | 20240502 | 173.0300 | 172.5100 | 173.4150 | 170.8900 |  94214915 |
|      | 20240501 | 169.3000 | 169.5800 | 172.7050 | 169.1100 |  50383147 |
|      | 20240430 | 170.3300 | 173.3300 | 174.9900 | 170.0000 |  65934776 |
|      | 20240429 | 173.5000 | 173.3700 | 176.0300 | 173.1000 |  68169419 |
|      | 20240426 | 169.3000 | 169.8800 | 171.3400 | 169.1800 |  44838354 |
|      | 20240425 | 169.8900 | 169.5250 | 170.6100 | 168.1511 |  50558329 |
|      | 20240424 | 169.0200 | 166.5400 | 169.3000 | 166.2100 |  48251835 |
|      | 20240423 | 166.9000 | 165.3500 | 167.0500 | 164.9200 |  49537761 |
|      | 20240422 | 165.8400 | 165.5150 | 167.2600 | 164.7700 |  48116443 |
|      | 20240419 | 165.0000 | 166.2100 | 166.4000 | 164.0750 |  68149377 |
...
+------+----------+----------+----------+----------+----------+-----------+
시장분류코드를 입력하세요 (FY:뉴욕, FN:나스닥, FA:아멕스): FN
종목코드를 입력하세요 (ex.AAPL): AAPL
차트종류를 입력하세요 (1:틱, 2:분, 3:일, 4:주, 5:월): 2
N봉을 입력하세요: 5
Row Count = 97
+--------+----------+----------+----------+----------+----------+---------+
|  Hour  |   Date   |   Prpr   |   Oprc   |   Hprc   |   Lprc   | CntgVol |
+--------+----------+----------+----------+----------+----------+---------+
| 120500 | 20240517 | 189.6572 | 189.7080 | 189.7100 | 189.6300 |  32515  |
| 120000 | 20240517 | 189.7080 | 189.5800 | 189.7250 | 189.5501 |  144102 |
| 115500 | 20240517 | 189.5800 | 189.5799 | 189.6400 | 189.5600 |  136877 |
| 115000 | 20240517 | 189.5799 | 189.4591 | 189.6000 | 189.4550 |  158070 |
| 114500 | 20240517 | 189.4550 | 189.5850 | 189.6199 | 189.4201 |  217232 |
| 114000 | 20240517 | 189.5850 | 189.5601 | 189.6500 | 189.5300 |  138736 |
| 113500 | 20240517 | 189.5601 | 189.6100 | 189.6400 | 189.5205 |  238293 |
| 113000 | 20240517 | 189.6100 | 189.6970 | 189.7100 | 189.5700 |  302512 |
| 112500 | 20240517 | 189.6970 | 189.7800 | 189.8600 | 189.6800 |  262114 |
| 112000 | 20240517 | 189.7800 | 189.8500 | 189.8550 | 189.6520 |  218262 |
| 111500 | 20240517 | 189.8500 | 189.8850 | 189.9700 | 189.8500 |  168481 |
| 111000 | 20240517 | 189.8850 | 189.9450 | 189.9500 | 189.8599 |  149988 |
| 110500 | 20240517 | 189.9450 | 189.8300 | 189.9600 | 189.8000 |  193492 |
| 110000 | 20240517 | 189.8300 | 189.9650 | 189.9750 | 189.7900 |  211673 |
| 105500 | 20240517 | 189.9650 | 189.9590 | 190.0000 | 189.8300 |  222180 |
'''
