import asyncio
import dbopenapi
from common import *
from app_keys import appkey, appsecretkey, saved_access_token # app_keys.py 파일에 appkey, appsecretkey 변수를 정의하고 사용하세요

'''
해외선물옵션 로그인시 반드시 wss_domain 옵션을 dbopenapi.WSS_URL_GLOBAL로 설정.
'''
async def main():
    api=dbopenapi.OpenApi()
    # if not await api.login(appkey, appsecretkey, wss_domain=dbopenapi.WSS_URL_GLOBAL): return print(f'연결실패: {api.last_message}')
    if not await api.login('', '', access_token=saved_access_token, wss_domain=dbopenapi.WSS_URL_GLOBAL): return print(f'연결실패: {api.last_message}')

    while True:
        종목코드 = input('종목코드를 입력하세요: ')
        차트종류 = input('차트종류를 입력하세요 (1:틱, 2:분, 3:일, 4:주, 5:월): ')
        N봉 = input('N봉을 입력하세요: ') if 차트종류 == '1' or 차트종류 == '2' else ''
        
        response = None
        trcode = None
        if 차트종류 == '1': # 틱
            request = {
                'In': {
                    'Code': 종목코드, # 종목코드
                    'Tick': N봉, # N tick
                    'Dcnt': '400', # 조회건수
                    'Dedt': '99999999' # 조회일자
                }
            }
            trcode = 'pibg7301'
        elif 차트종류 == '2': # 분
            request = {
                'In': {
                    'Code': 종목코드, # 종목코드
                    'Tick': N봉, # N tick
                    'Dcnt': '400', # 조회건수
                    'Dedt': '99999999' # 조회일자
                }
            }
            trcode = 'pibg7302'
        elif 차트종류 == '3': # 일
            request = {
                'In': {
                    'Code': 종목코드, # 종목코드
                    'Dtgb': '0', # 데이터구분 (0:일, 1:주, 2:월)
                    'Dcnt': '400', # 조회건수
                    'Dedt': '999999' # 조회일자
                }
            }
            trcode = 'pibg7303'
        elif 차트종류 == '4': # 주
            request = {
                'In': {
                    'Code': 종목코드, # 종목코드
                    'Dtgb': '1', # 데이터구분 (0:일, 1:주, 2:월)
                    'Dcnt': '400', # 조회건수
                    'Dedt': '999999' # 조회일자
                }
            }
            trcode = 'pibg7303'
        elif 차트종류 == '5': # 월
            request = {
                'In': {
                    'Code': 종목코드, # 종목코드
                    'Dtgb': '2', # 데이터구분 (0:일, 1:주, 2:월)
                    'Dcnt': '400', # 조회건수
                    'Dedt': '999999' # 조회일자
                }
            }
            trcode = 'pibg7303'
        if not trcode:
            print('잘못된 차트종류 입력')
            continue
        
        response = await api.request(trcode, request)
        if response is None:
            print(f'요청실패: {api.last_message}')
        else:
            print_table(response.body['Out'])
            print_table(response.body['Out1'])
            
        pass # end while, 시장분류코드 입력받기 위한 무한루프
    
    ... # 다른 작업 수행
    await api.close()

asyncio.run(main())


# Output:
'''
종목코드를 입력하세요: HSIK24
차트종류를 입력하세요 (1:틱, 2:분, 3:일, 4:주, 5:월): 3
Field Count = 6
+------+-------+
| key  | value |
+------+-------+
| Pind |   1   |
| Nrec |   76  |
| Ikey |       |
| Sdir |       |
| Aflg |       |
| Nrow |  0076 |
+------+-------+
Row Count = 76
+----------+-------+--------+-------+-------+-------+
|   Date   |  Clos |  Tvol  |  Open |  High |  Lowp |
+----------+-------+--------+-------+-------+-------+
| 20240205 | 15564 |   0    | 16201 | 16201 | 15564 |
| 20240206 | 16022 |   2    | 16022 | 16022 | 16022 |
| 20240207 | 16454 |   4    | 16203 | 16454 | 16203 |
| 20240208 | 16454 |   0    | 16454 | 16454 | 16454 |
| 20240209 | 16454 |   0    | 16454 | 16454 | 16454 |
| 20240212 | 16454 |   0    | 16454 | 16454 | 16454 |
| 20240213 | 16454 |   0    | 16454 | 16454 | 16454 |
| 20240214 | 16454 |   0    | 16454 | 16454 | 16454 |
| 20240215 | 15854 |   60   | 15927 | 15927 | 15836 |
| 20240216 | 15854 |   0    | 15854 | 15854 | 15854 |
| 20240219 | 15854 |   0    | 15854 | 15854 | 15854 |
| 20240220 | 15854 |   0    | 15854 | 15854 | 15854 |
| 20240221 | 15854 |   0    | 15854 | 15854 | 15854 |
| 20240222 | 15854 |   0    | 15854 | 15854 | 15854 |
| 20240223 | 16768 |   5    | 16768 | 16768 | 16768 |
| 20240226 | 16768 |   0    | 16768 | 16768 | 16768 |
| 20240227 | 16837 |   11   | 16792 | 16837 | 16774 |
...
종목코드를 입력하세요: HSIK24
차트종류를 입력하세요 (1:틱, 2:분, 3:일, 4:주, 5:월): 2
N봉을 입력하세요: 5
Field Count = 6
+------+-------+
| key  | value |
+------+-------+
| Pind |   1   |
| Nrec |  400  |
| Ikey |       |
| Sdir |       |
| Aflg |       |
| Nrow |  0400 |
+------+-------+
Row Count = 400
+----------+----------+--------+-------+-------+-------+-------+-------+
|   Date   |   Bday   |  Time  |  Clos |  Lvol |  Open |  High |  Lowp |
+----------+----------+--------+-------+-------+-------+-------+-------+
| 20240514 | 20240515 | 224000 | 19097 |  291  | 19096 | 19107 | 19084 |
| 20240514 | 20240515 | 224500 | 19071 |  287  | 19095 | 19103 | 19069 |
| 20240514 | 20240515 | 225000 | 19101 |  272  | 19073 | 19103 | 19073 |
| 20240514 | 20240515 | 225500 | 19090 |  203  | 19100 | 19108 | 19090 |
| 20240514 | 20240515 | 230000 | 19072 |  231  | 19091 | 19093 | 19070 |
| 20240514 | 20240515 | 230500 | 19095 |  221  | 19074 | 19098 | 19061 |
| 20240514 | 20240515 | 231000 | 19069 |  171  | 19095 | 19096 | 19066 |
| 20240514 | 20240515 | 231500 | 19070 |  132  | 19067 | 19090 | 19067 |
| 20240514 | 20240515 | 232000 | 19059 |  204  | 19071 | 19072 | 19046 |
| 20240514 | 20240515 | 232500 | 19034 |  352  | 19060 | 19060 | 19027 |
| 20240514 | 20240515 | 233000 | 19066 |  159  | 19036 | 19068 | 19033 |
| 20240514 | 20240515 | 233500 | 19055 |  135  | 19065 | 19072 | 19042 |
| 20240514 | 20240515 | 234010 | 19054 |  219  | 19042 | 19060 | 19038 |
| 20240514 | 20240515 | 234500 | 19050 |  140  | 19054 | 19054 | 19044 |
| 20240514 | 20240515 | 235000 | 19081 |  220  | 19053 | 19084 | 19053 |
| 20240514 | 20240515 | 235500 | 19088 |  200  | 19081 | 19098 | 19078 |
| 20240515 | 20240515 | 000000 | 19090 |  211  | 19088 | 19105 | 19088 |
|...
'''
